In [1]:
import pandas as pd
import numpy as np

In [2]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])

In [3]:
string_data.notnull()

0     True
1     True
2    False
3     True
dtype: bool

In [87]:
df = pd.DataFrame(np.random.randn(7, 3))
df.iloc[:4, 1] = np.nan
df.iloc[:2, 2] = np.nan
df.dropna(thresh=1)

          0         1         2
0 -0.183819       NaN       NaN
1  1.269451       NaN       NaN
2  0.471864       NaN -0.669060
3  0.378620       NaN  0.773732
4 -2.014759 -0.913671  0.140082
5 -0.663247  2.155179  0.231796
6  1.039349  0.772202  0.294423

In [43]:
del_cols = [x for i,x in enumerate(df.columns) if np.sum(df[x].isnull())>=3]
df.drop(labels=del_cols,axis=1)

          0         2
0  0.632406       NaN
1 -0.395602       NaN
2  0.618949  0.460088
3  2.863007 -0.153229
4  0.052645  0.370009
5  0.663952 -0.425215
6  0.598975 -1.464444

In [110]:
df2 = pd.DataFrame([[1,1,1],[1,1,3],[1,3,4]])
df3 = df2[~df2.isin([1])].dropna(thresh=1).fillna(1)
df3.index = [0,1]
df3

     0    1    2
0  1.0  1.0  3.0
1  1.0  3.0  4.0

In [113]:
df.fillna({1:0,2:1})

          0         1         2
0 -0.183819  0.000000  1.000000
1  1.269451  0.000000  1.000000
2  0.471864  0.000000 -0.669060
3  0.378620  0.000000  0.773732
4 -2.014759 -0.913671  0.140082
5 -0.663247  2.155179  0.231796
6  1.039349  0.772202  0.294423

In [116]:
df = pd.DataFrame(np.random.randn(6, 3))
df.iloc[2:, 1] = np.nan
df.iloc[4:, 2] = np.nan
df

          0         1         2
0 -0.736932  0.221568  1.026291
1 -0.487949 -0.458899 -1.524919
2  0.082537       NaN  0.076203
3 -0.156962       NaN  0.855237
4  0.591625       NaN       NaN
5  2.955495       NaN       NaN

In [119]:
df.fillna(method='ffill',limit=2)

          0         1         2
0 -0.736932  0.221568  1.026291
1 -0.487949 -0.458899 -1.524919
2  0.082537 -0.458899  0.076203
3 -0.156962 -0.458899  0.855237
4  0.591625       NaN  0.855237
5  2.955495       NaN  0.855237

In [121]:
data = pd.Series([1., np.nan, 3.5, np.nan, 7])
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [124]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                      'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [126]:
#返回重复的行
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [128]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [130]:
data['v1'] = range(7)
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [135]:
#根据ｋ１,ｋ２列查询重复行
data.duplicated(["k1","k2"])

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [139]:
#保留重复的最后一个行
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [141]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
                               'Pastrami', 'corned beef', 'Bacon',
                              'pastrami', 'honey ham', 'nova lox'],
                     'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [143]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [145]:
meat_to_animal = {
  'bacon': 'pig',
  'pulled pork': 'pig',
  'pastrami': 'cow',
  'corned beef': 'cow',
  'honey ham': 'pig',
  'nova lox': 'salmon'
}

In [154]:
lowercased = data['food'].str.lower()
data['animal'] = lowercased.map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [157]:
data['food'].map(lambda x:meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [159]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])

In [162]:
#替换值
data.replace({-999:np.nan,-1000:0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [165]:
data.replace([-999,-1000],[np.nan,0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [173]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                    index=['Ohio', 'Colorado', 'New York'],
                columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [169]:
data.index.map(lambda x:x[:4].upper())

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [177]:
data.rename(index=str.title, columns=str.upper)

          ONE  TWO  THREE  FOUR
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [180]:
data.rename(index={'OHIO': 'INDIANA'},
            columns={'three': 'peekaboo'})

          one  two  peekaboo  four
Ohio        0    1         2     3
Colorado    4    5         6     7
New York    8    9        10    11

In [181]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]
bins = [18, 25, 35, 60, 100]

In [190]:
cats = pd.cut(ages,bins,right=False)
cats.codes
pd.value_counts(cats).sort_index()

[18, 25)     4
[25, 35)     4
[35, 60)     3
[60, 100)    1
dtype: int64

In [204]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']
cuts = pd.cut(ages, bins, labels=group_names)
cuts

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

In [198]:
pd.value_counts(cuts)

Youth         5
MiddleAged    3
YoungAdult    3
Senior        1
dtype: int64

In [205]:
data = np.random.rand(20)
pd.cut(data,bins=4,precision=2)
pd.value_counts(pd.cut(data,bins=4,precision=2))

(0.76, 0.95]    7
(0.58, 0.76]    5
(0.2, 0.39]     5
(0.39, 0.58]    3
dtype: int64

In [ ]:
data2 = np.random.randn(1000)
pd.value_counts(pd.qcut(data2,4))
pd.qcut(data2,4).codes